In [23]:
import pandas as pd
df = pd.read_excel('Excel_Sample.xlsx')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [24]:
df.to_csv('My_output.csv',index=False)

In [25]:
pd.read_csv('My_output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [28]:
# df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

## Reading SQL

In [29]:
from sqlalchemy import create_engine

In [30]:
engine = create_engine('sqlite:///:memory:')

In [31]:
df.to_sql('my_table',engine)

In [32]:
sqldf = pd.read_sql('my_table',con=engine)

In [33]:
sqldf

   index  Unnamed: 0   a   b   c   d
0      0           0   0   1   2   3
1      1           1   4   5   6   7
2      2           2   8   9  10  11
3      3           3  12  13  14  15

In [ ]:
! git add Data_input_and_ouput.ipynb
! git commit -m "22:16/04-06-2021"
! git push origin main